#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.main.data.http.ssh_keys: Reading...
module.main.data.http.ssh_keys: Read complete after 0s [id=https://github.com/browniebroke.keys]
module.main.aws_s3_bucket.media_bucket: Refreshing state... [id=browniebroke-media]
module.main.aws_ecr_repository.app_ecr_repo: Refreshing state... [id=myapp]
module.main.aws_vpc.production-vpc: Refreshing state... [id=vpc-0d81564eaa594ca38]
module.main.aws_key_pair.production: Refreshing state... [id=production_key_pair]
module.main.aws_cloudwatch_log_group.django-log-group: Refreshing state... [id=/ecs/myapp]
module.main.aws_iam_role.ecs-host-role: Refreshing state... [id=ecs_host_role_prod]
module.main.aws_iam_role.ecs-service-role: Refreshing state... [id=ecs_service_role_prod]
module.main.aws_s3_bucket.static_bucket: Refreshing state... [id=browniebroke-static]
module.main.aws_ecs_cluster.production: Refreshing state... [id=arn:aws:ecs:eu-west-2:111579726218:cluster/production-cluster]
module.main.aws_iam_instance_profile.ecs: Refreshing state... [id=ecs_instance_profile_prod]
module.main.aws_iam_role_policy.ecs-instance-role-policy: Refreshing state... [id=ecs_host_role_prod:ecs_instance_role_policy]
module.main.aws_iam_role_policy.ecs-service-role-policy: Refreshing state... [id=ecs_service_role_prod:ecs_service_role_policy]
module.main.aws_cloudwatch_log_stream.django-log-stream: Refreshing state... [id=myapp-log-stream]
module.main.aws_subnet.public-subnet-1: Refreshing state... [id=subnet-0b941ea2876dd8206]
module.main.aws_security_group.load-balancer: Refreshing state... [id=sg-0fc25c88d90955847]
module.main.aws_subnet.public-subnet-2: Refreshing state... [id=subnet-08f07f5c848e74bf2]
module.main.aws_subnet.private-subnet-1: Refreshing state... [id=subnet-0b7e7370180d1330e]
module.main.aws_route_table.private-route-table: Refreshing state... [id=rtb-00c5532ff7b0e8b77]
module.main.aws_subnet.private-subnet-2: Refreshing state... [id=subnet-0885ab64f53876dea]
module.main.aws_route_table.public-route-table: Refreshing state... [id=rtb-0e5e332f3554afd52]
module.main.aws_alb_target_group.default-target-group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:111579726218:targetgroup/production-tg/87ab9a57ea5c1917]
module.main.aws_internet_gateway.production-igw: Refreshing state... [id=igw-0e1b36fc71216e447]
module.main.aws_s3_bucket_acl.static_bucket_acl: Refreshing state... [id=browniebroke-static,public-read]
module.main.aws_s3_bucket_acl.media_bucket_acl: Refreshing state... [id=browniebroke-media,public-read]
module.main.aws_security_group.ecs: Refreshing state... [id=sg-0851edd013e68d0f9]
module.main.aws_route_table_association.public-route-1-association: Refreshing state... [id=rtbassoc-07c1e6ec69b6a785a]
module.main.aws_route.public-internet-igw-route: Refreshing state... [id=r-rtb-0e5e332f3554afd521080289494]
module.main.aws_eip.elastic-ip-for-nat-gw: Refreshing state... [id=eipalloc-0296fe061bbc7967e]
module.main.aws_route_table_association.public-route-2-association: Refreshing state... [id=rtbassoc-081901621cf794c22]
module.main.aws_lb.production: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:111579726218:loadbalancer/app/production-alb/f8f32ef8ad02d30d]
module.main.aws_route_table_association.private-route-1-association: Refreshing state... [id=rtbassoc-0c844950c91aa67ce]
module.main.aws_db_subnet_group.production: Refreshing state... [id=main]
module.main.aws_route_table_association.private-route-2-association: Refreshing state... [id=rtbassoc-0a954648d147471e7]
module.main.aws_launch_configuration.ecs: Refreshing state... [id=production-cluster]
module.main.aws_security_group.rds: Refreshing state... [id=sg-0d537987e7224e369]
module.main.aws_nat_gateway.nat-gw: Refreshing state... [id=nat-0ad42057fff432dd9]
module.main.aws_route.nat-gw-route: Refreshing state... [id=r-rtb-00c5532ff7b0e8b771080289494]
module.main.aws_alb_listener.ecs-alb-http-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:111579726218:listener/app/production-alb/f8f32ef8ad02d30d/17ba6f18a6c4b7c3]
module.main.aws_autoscaling_group.ecs-cluster: Refreshing state... [id=production_auto_scaling_group]
module.main.aws_db_instance.production: Refreshing state... [id=production]
module.main.aws_ecs_task_definition.app: Refreshing state... [id=myapp-task]
module.main.aws_ecs_service.production: Refreshing state... [id=arn:aws:ecs:eu-west-2:111579726218:service/production-cluster/production-myapp-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.main.aws_cloudfront_distribution.media_distribution will be created
  + resource "aws_cloudfront_distribution" "media_distribution" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "MediaBucketOrigin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "browniebroke-media.s3.eu-west-2.amazonaws.com"
          + origin_id           = "MediaBucketOrigin"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.main.aws_cloudfront_distribution.static_distribution will be created
  + resource "aws_cloudfront_distribution" "static_distribution" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "StaticBucketOrigin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "browniebroke-static.s3.eu-west-2.amazonaws.com"
          + origin_id           = "StaticBucketOrigin"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>